package com.osunji.melog.inquirySettings.service;

import com.osunji.melog.global.dto.ApiMessage;
import com.osunji.melog.inquirySettings.dto.response.PrivacyResponse;
import org.springframework.stereotype.Service;

@Service
public class PrivacyService {
    public ApiMessage<PrivacyResponse> privacyService() {

        PrivacyResponse body = PrivacyResponse.builder()
                .privacy_content(setPrivacyContent())
                .build();
        return ApiMessage.success(200, "successfully private message transmitted", body);
    }

    private String setPrivacyContent() {
        String privacyContent = "멜로그(개발자 - 홈페이지 주소) 이하 (개발자 - 홈페이지 이름)는「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.\n" +
                "\n" +
                "이 개인정보처리방침은 2025년 12월 08일부터 적용됩니다.\n" +
                "\n" +
                "제 1조 (목적)\n" +
                "\n" +
                "약관은 학생들이 운영하는 ‘Melog’(이하 ‘사이트’)가 제공하는 모든 서비스(이하 “Melog”)의 이용조건 및 절차, 이용자/회원과 당 사이트의 권리, 의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.\n" +
                "\n" +
                "제 2조 (약관의 효력과 변경)\n" +
                "\n" +
                "① 당 서비스는 이용자/회원이 본 약관 내용에 동의하는 것을 조건으로 이용자/회원에 한하여 서비스를 제공할 것이며, 이용자/회원이 본 약관의 내용에 동의하는 경우, 당 사이트의 서비스 제공 행위 및 이용자/회원의 서비스 사용 행위에는 본 약관이 우선적으로 적용됩니다.\n" +
                "\n" +
                "② 당 서비스는 필요하다고 인정되는 경우 변경할 수 있으며, 여러분은 주기적으로 이 페이지를 검토하는 것이 좋습니다.\n" +
                "\n" +
                "③ 이용자가 변경된 약관에 동의하지 아니하는 경우, 본인의 회원 등록을 취소할 수 있으며, 계속 사용의 경우는 약관 변경에 대한 동의로 간주됩니다.\n" +
                "\n" +
                "제 3조 (용어의 정의)\n" +
                "\n" +
                "본 약관에서 사용하는 용어의 정의는 다음 각 호와 같습니다.\n" +
                "\n" +
                "① 서비스 : ‘오선지’(이하 “Melog’)가 제공하는 제반 서비스(정보제공, 부가서비스 등)\n" +
                "\n" +
                "② 이용자 :  당 사이트에 접속하여 본 약관에 따라 ‘오선지’(이하 “Melog”)가 제공하는 회원 및 방문자\n" +
                "\n" +
                "③ 소셜 로그인 인증 : 포털‧사회관계망서비스(SNS) 가입자가 해당 ID로 다른 웹사이트나 애플리케이션에 접속하는 기능\n" +
                "\n" +
                "제 4조 (이용 계약의 성립)\n" +
                "\n" +
                "① 이용계약은 신청자가 온라인으로 당 사이트에서 제공하는 소정의 가입신청 양식에서 요구하는 사항을 기록하여 가입을 완료하는 것으로 성립됩니다.\n" +
                "\n" +
                "② 사용자는 사이트를 합법적이고 윤리적인 방식으로 이용해야 하며, 다음 사항을 준수해야 합니다.\n" +
                "다른 사용자의 권리를 침해하지 않을 것\n" +
                "허위 정보를 입력하거나 부적절한 행위를 하지 않을 것\n" +
                "\n" +
                "③ 회원은 이용신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 해야 하며 회원정보를 변경하지 아니하여 발생되는 일련의 모든 문제의 책임은 회원에게 있습니다.\n" +
                "\n" +
                "④ 운영진은 필요에 따라 서비스를 중단하거나 종료할 수 있으며, 이용자가 약관을 위반할 경우 서비스 이용을 제한할 수 있습니다.\n" +
                "\n" +
                "제 5조 (개인정보)\n" +
                "\n" +
                "①  ‘오선지’는 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하고 존중하기 위해 노력합니다. 회원의 개인정보보호에 관해서는 관련법령 및 서비스에서 정하는 “개인정보보호정책”에 정한 바에 의합니다.\n" +
                "\n" +
                "② 서비스가 수집하는 개인정보는 서비스의 제공에 필요한 최소한으로 하되, 필요한 경우 보다 더 자세한 정보가 요구될 수 있습니다.\n" +
                "\n" +
                "제 6조 (서비스)\n" +
                "\n" +
                "①  ‘Melog’(이하 사이트)가 제공하는 서비스는 --\n" +
                "\n" +
                "② ‘Melog’는 이용자에게 책임에 관한 것에 대해 말할 때, 우리가 언제나 업데이트하고 정확하게 유지하기 위해 노력하고 있지만, 정보를 제공할 수 있도록 제 3자에게 의존하고 있다는 점을 고려해야 합니다. ‘Melog’에 완전히 의존하여 경험하는 모든 손실에 대해 어떠한 책임도 지지 않습니다.\n" +
                "\n" +
                "③ 서비스 이용시간은 당 사이트의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간을 원칙으로 합니다\n" +
                "\n" +
                "제7조 (콘텐츠 이용 및 저작권)\n" +
                "\n" +
                "① Melog 서비스는 유튜브 API 및 임베드 기능을 활용하여 콘텐츠를 제공하며, 해당 콘텐츠의 저작권은 원저작자 및 제공 플랫폼(YouTube 등)에 귀속됩니다.\n" +
                "\n" +
                "② 사용자는 서비스를 통해 제공되는 콘텐츠를 임의로 다운로드, 복제, 배포, 2차적 저작물 작성 등 저작권을 침해하는 행위를 하여서는 안 됩니다.\n" +
                "\n" +
                "③ 서비스 내 게시물(댓글, 감상 기록 등)에 외부 동영상 링크를 공유하는 경우, 사용자는 해당 콘텐츠의 저작권 및 관련 법규를 준수하여야 하며, 그로 인해 발생하는 모든 법적 책임은 게시한 사용자 본인에게 있습니다.\n" +
                "\n" +
                "④ 회사는 저작권자의 요청 또는 법령에 따라 저작권을 침해하는 게시물에 대해 사전 통지 없이 삭제하거나 게시 중단 조치를 취할 수 있습니다.\n" +
                "\n" +
                "제 8조 (손해배상)\n" +
                "\n" +
                "‘Melog’(이하 사이트)는 무료로 제공하는 서비스의 이용과 관련하여 개인정보보호정책에서 정하는 내용에 위반하지 않는 한 어떠한 손해도 책임을 지지 않습니다.\n" +
                "\n" +
                "[부칙]\n" +
                "이 약관은 2025년 12월 08일부터 시행됩니다";
        return privacyContent;

    }
}
